export const Colors = {
  primary: '#195CC5',    // Основной цвет кнопки (синий)
  disabled: '#ADADAD',   // Цвет кнопки в отключенном состоянии (серый)
  white: '#FFFFFF',      // Цвет текста кнопки
  background: '#F0F0F0', // Цвет фона экрана и полей ввода
  secondary: '#FF7F7F',  // Вторичный цвет (красный, например, для рамки кода)
  text: '#333333',       // Основной цвет текста (темно-серый)
  accent: '#5856D6',     // Акцентный цвет (фиолетовый, для выделения)
  success: '#34C759',    // Цвет успеха (зеленый, для подтверждений)
  error: '#FF3B30',      // Цвет ошибки (красный, для предупреждений)
  border: '#E0E0E0',     // Цвет границы (светло-серый)
  error_card:'#b91c1c'   // Цыет ошибки оплаты карточки
};