export const TEXTS = {
  // Welcome Screen
  WELCOME_TITLE: "TALLK",
  WELCOME_MESSAGE: "Приветствуем 👋",
  CONTINUE_AS: "Продолжить как",
  MASTER: "Мастер",
  CLIENT: "Клиент",

  // Input Component
  INPUT_ERROR_PASSWORD: "Некорректный пароль",
  LOGIN_PASSWORD_PLACEHOLDER: "Пароль",
  LOGIN_TERMS: "Нажимая “Войти” Вы соглашаетесь с политикой и условиями использования сервиса.",
  PLACEHOLDER_DEFAULT: 'Введите значение',
  PLACEHOLDER_DESCRIPTION: 'Описание',
  PLACEHOLDER_TIME: '12:00',
  SUBTEXT_DEFAULT: 'Нажимая “Войти” Вы соглашаетесь с политикой и условиями использования сервиса.',
  ERROR_VALIDATION:
    'Пароль должен содержать не менее 8 символов, букв разных регистров, цифры и спец. символы',
  SUCCESS_PASSWORD: 'Надёжный пароль',

  // Login Screen
  LOGIN_TITLE: "Авторизация",
  LOGIN_MESSAGE: "Авторизация",
  LOGIN_PHONE_PLACEHOLDER: "Введите номер телефона",
  LOGIN_SUBTEXT: "Зачем пароль?",
  LOGIN_SUBTEXT_HIGHLIGHTED: "Политика",
  LOGIN_BUTTON: "Продолжить",
  CONTINUE: "Продолжить",
  FORGOT_PASSWORD: "Забыли пароль?",
  SUPPORT: "Поддержка",

  // Verification Screen
  VERIFICATION_TITLE: "Подтвердите номер",
  VERIFICATION_MESSAGE: "Код подтверждения отправлен на номер",
  RESEND_TEXT: "Запросить снова через",
  RESEND_SECONDS: "сек.",
  RESEND_LINK: "Запросить снова",
  INVALID_CODE: "Неверный код",

  // Password Screen
  PASSWORD_TITLE: "Введите пароль",

  // Register Screen
  REGISTER_TITLE: "Создайте пароль",
  REGISTER_BUTTON: "Зарегистрироваться",
  CONFIRM_PASSWORD_PLACEHOLDER: "Подтвердите пароль",
  PASSWORDS_DO_NOT_MATCH: "Пароли не совпадают",
  REGISTRATION_TERMS: "Нажимая “Войти” Вы соглашаетесь с политикой и условиями использования сервиса.",
  REGISTRATION_TERMS_HIGHLIGHTED: "политикой и условиями",
};