export const TEXTS = {
    // Welcome Screen
    WELCOME_TITLE: "TALLK",
    WELCOME_MESSAGE: "Приветствуем 👋",
    INPUT_ERROR_PASSWORD: "Некорректный пароль",
    LOGIN_PASSWORD_PLACEHOLDER: "Пароль",
    LOGIN_TERMS: "Нажимая “Войти” Вы соглашаетесь с политикой и условиями использования сервиса.",
  
    // Input Component
    PLACEHOLDER_DEFAULT: 'Введите значение',
    PLACEHOLDER_DESCRIPTION: 'Описание',
    PLACEHOLDER_TIME: '12:00',
    SUBTEXT_DEFAULT: 'Нажимая “Войти” Вы соглашаетесь с политикой и условиями использования сервиса.',
    ERROR_VALIDATION:
      'Пароль должен содержать не менее 8 символов, букв разных регистров, цифры и спец. символы',
    SUCCESS_PASSWORD: 'Надёжный пароль',
  };